package com.lee.lesson_saple.basic;

public class HomeWork_0227 {
    public static void main(String[] args) {

//        假設某個自動售票機只能接受10元、5元、1元的硬幣。請設計一程式，當使用者輸入一小於999的正整數數字時，他所需投入各種幣值硬幣最少的數量分別是多少？若數字大於999則顯示：輸入過大。
//        例如
//        使用者輸入：123，則程式顯示：10元12個，5元0個，2元3個。

//        請撰寫一程式，計算出輸入之整數除以13的商數與餘數。
//        例如：
//        輸入26，輸出商數=2、餘數=0。

//        雞兔同籠計算機程式，使用者輸入頭腳分別是多少，程式輸出雞兔各有幾隻。
//        例如：
//        頭8，腳26，輸出為：雞3，兔5。若無解則輸出："該數據無解"。

//        請設計一程式，讓使用者輸入任意整數，程式判斷該數字為奇數或偶數。
//        例：輸入5，輸出奇數；輸入6，輸出偶數。

//        請設計一程式，從使用者得到一大於0的整數數字n，輸出1+2+3+..+n之結果。
//        例如：輸入5，輸出15




    }



}
